src/1c/src/Documents/КурьерскаяЗаявка/КурьерскаяЗаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КурьерскаяЗаявка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/1c/src/InformationRegisters/СтатусыКурьерскихЗаявок/СтатусыКурьерскихЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКурьерскихЗаявок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКурьерскихЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КурьерскаяЗаявка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/1c/src/Documents/КурьерскаяЗаявка/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Набор = РегистрыСведений.СтатусыКурьерскихЗаявок.СоздатьНаборЗаписей();
	Набор.Отбор.Заявка.Установить(Ссылка);
	Период = ТекущаяДатаСеанса();
	Запись = Набор.Добавить();
	Запись.Заявка = Ссылка;
	Запись.Статус = ДополнительныеСвойства.Статус;
	Запись.Период = Период;
	Набор.Записать();

	КурьерскиеЗаявкиИнтеграция.ОтправитьДанныеПоЗаявке(Ссылка);
КонецПроцедуры
